ruby/deps/t/res/tsik_tcport/java-output/testStele.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body Id="ID1">
  <ns3:YahooUserOnline xmlns:ns3="urn:allesta-YahooUserPing">
   <username xsi:type="xsd:string">fgx3prak</username>
  </ns3:YahooUserOnline>
 </SOAP-ENV:Body>
<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#xmlns(SOAP-ENV=http://schemas.xmlsoap.org/soap/envelope/) xpointer(/SOAP-ENV:Envelope/SOAP-ENV:Body)"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>ORdO1qU/FPl9GSBU+OOpEIvzrJ4=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>isoSICv/nDP2bNAXK1GqTNjQ218P/UKm0BBVDPY1K+an+k31cfJ9tQ1/F/eUF7qEuZETiXqX
f9f+/jLeKAcuS5njO1MNP+4KBZpoer1Mnb8QBiH2/GJvXWYasPuzzVAF/A+2i403oJSdH0j5
XqdCY4Wh7TuDkI5NJhBoaWJ/jGI=</ds:SignatureValue><ds:KeyInfo><ds:KeyValue><ds:RSAKeyValue><ds:Modulus>oqi99By1VYo0aHrkKCNT4DkIgPL/SgahbeKdGhrbu3K2XG7arfD9tqIBIKMfrX4Gp90NJa85
AV1yiNsEyvq+mUnMpNcKnLXLOjkTmMCqDYbbkehJlXPnaWLzve+mW0pJdPxtf3rbD4PS/cBQ
IvtpjmrDAU8VsZKT8DN5Kyz+EZs=</ds:Modulus><ds:Exponent>AQAB</ds:Exponent></ds:RSAKeyValue></ds:KeyValue></ds:KeyInfo></ds:Signature></SOAP-ENV:Envelope>
